// -------------------------------------------------------------
// グローバル変数
// -------------------------------------------------------------
float4x4 mWVP;  // ローカルから射影空間への座標変換

// -------------------------------------------------------------
// 頂点シェーダからピクセルシェーダに渡すデータ
// -------------------------------------------------------------
struct VS_OUTPUT
{
     float4 Pos : POSITION;
     float4 Col : COLOR0;
};

// -------------------------------------------------------------
// 頂点シェーダプログラム
// -------------------------------------------------------------
VS_OUTPUT VS(
	float4 Pos : POSITION,          // モデルの頂点
	float3 Normal : NORMAL             // モデルの法線
) 
{
	VS_OUTPUT Out = (VS_OUTPUT)0;        // 出力データ
	float4 diffuse = { 1.0f, 0.0f, 0.0f, 1.0f };
	float4 amb = { 0.3f, 0.3f, 0.3f, 1.0f };
	float3 dir = { -0.6f, 0.6f,-0.6f };

	Out.Pos = mul(Pos, mWVP);            // 座標変換
	Out.Col = diffuse * max(dot(dir, Normal), 0) + amb;                     // 定数色

	return Out;
}

// -------------------------------------------------------------
// ピクセルシェーダプログラム
// -------------------------------------------------------------

float4 PS(
float4 Col : COLOR0) : COLOR
{
    return Col;
}

// -------------------------------------------------------------
// テクニック
// -------------------------------------------------------------
technique TShader
{
	pass P0
	{
		// シェーダ
		VertexShader = compile vs_2_0 VS();
		PixelShader = compile ps_2_0 PS();
	}
}